# Вывести длину наибольшей возрастающей подпоследовательности для каждого элемента и затем для всего массива
n=int(input())
a=list(map(int, input().split()))
dp = [1 for i in range(n)] # Заполняем новый массив единицами, так как каждый элемент оригинального массива сам по себе является возрастающей подпоследовательностью
for i in range(1,n):
    for j in range(i):
        if a[j]<a[i]:
            dp[i]=max(dp[i], dp[j]+1) # Выбираем между максимальной длиной подпоследовательностьи для текущего i-того элемента и длиной подпоследовательностьи j-того элемента с добавлением единички, так как мы собираемся включить в j-тую подпоследовательность i-тый элемент
print(dp) # Вывод всего массива для наглядности
dp.sort()
print(dp[n-1]) # Вывод ответа на задачу
