# Heap sort. Создать max-heap и класть корень(максимум) в конец массива(дерева), затем восстановить max-heap но уже для оставшейся части(не считая максимум который уже в конце).
#  sift_down занимает O(log n), построение max-heap занимает O(n) и сама сортировка занимает O(n * log n). В итоге уходит O(n * log n) времени
def sift_down(arr, n, i):
    while True:
        left = 2 * i + 1
        right = 2 * i + 2
        largest = i

        if left < n and arr[left] > arr[largest]:
            largest = left
        if right < n and arr[right] > arr[largest]:
            largest = right

        if largest == i:
            break

        arr[i], arr[largest] = arr[largest], arr[i]
        i = largest


def heap_sort(arr):
    n = len(arr)
    for i in range(n//2-1, -1, -1): # Построение max-heap. Начинаем с последнего родителя: n//2 - 1 и идём к корню(обходя все родители на текущем уровне справа на лево). После завершения цикла, дерево станет max_heap в котором каждый родитель больше детей
        sift_down(arr, n, i)

    # Сортировка(каждый раз вынимаем максимум в конец)
    for end in range(n - 1, 0, -1): # Начинаем с индекса последнего элемента (индекс последнего элемента неотсортированной части)
        arr[0], arr[end] = arr[end], arr[0] # Поменять корень (текущий максимум) с последним элементом неотсортированной части(в первой итерации с последним элементом). В итоге максимумы распологаются в самом конце друг за другом справа на лево, при этом мы их не трогаем при просеивании вниз, так как end всегда равен последнему элементу не отсортированной части
        sift_down(arr, end, 0) # Восстанавливаем heap до end-1. Начнаем с корня и идем до end-1. В итоге корнем опять становится максимум из текущей не отсортированной части.


a=list(map(int,input().split()))
heap_sort(a)
print(a)
