# Алгоритм Крускала для нахождения минимального остовного дерева. Алгоритм работает со списком ребер(с весами) за O(E*log(E))
# Алгоритм находит минимальное остовное дерево благодаря тому что сортиурет список ребер по весу, и по очереди добавляет мнимальные ребра проверяя их на создание цикла
# === DSU (Union-Find) ===
def find(x): # Ищем корень вершины
    if parent[x] != x: # Если корень вершины не равен самой вершине, значит эта вершина не является корнем
        parent[x] = find(parent[x])  # Ищем корень вершины, корнем является та вершина parent которой равен значению этой вершины
    return parent[x]

def union(parent, rank, u, v): # Функция для определения станет ли mst циклом если добавить путь от u до v 
    u = find(u) 
    v = find(v)

    if u != v: # Если корни вершин разные, то выполняем блок. Если корни вершин одинаковые, значит при добавлении текущего ребра появится цикл(не выполняем блок) 
        if rank[u] < rank[v]: # Вершина ранг которой больше, является предком вершины ранг которого меньше
            u,v=v,u
        if rank[u]==rank[v]:
            rank[u] += 1 # Увеличиваем ранг корня при первой итерации(когда ранги всех вершин равны), это нужно чтобы при последующих итерациях можно было сравнивать ранги чтобы определить какая вершина будет родительской
        parent[v]=u # Добавляем произвольный корень при первой итерации, это нужно чтобы была вершина с которой идет отсчет. При последующих итерациях ускоряет поиск истинного корня
        return True
    return False


# === Алгоритм Крускала ===
def kruskal(n, edges):
    edges.sort() # Сортируем рёбра по весу, это позволит добавлять ребра начиная с самых дешевых
    rank = [0]*(n+1) # Массив для подсчета ранга каждой вершины(только корни имеют ненулевой ранг)
    cost = 0   # суммарный вес

    for w,u,v in edges:
        if union(parent, rank, u, v):
            cost+=w
    return cost

n = int(input("Количество ребер: "))
edges=[]
for i in range(n):
    w,u,v=map(int,input("Вес-от-до: ").split()) # Edges list с весом каждого ребра в виде (weight, u, v)
    edges.append((w,u,v))

parent = [i for i in range(n+1)] # Массив который будет хранить корни каждой вершины
cost=kruskal(n,edges)
print(cost)
# edges = [
#     (1, 1, 2), # (вес, откуда, куда)
#     (4, 2, 3),
#     (2, 1, 3),
#     (3, 3, 4),
#     (5, 2, 4),
# ]
