# Необходимо составить такое расписание в котором проводится максимальное колво занятии, при этом никакая из занятии не должно пересекаться с другим.
# Для решения на каждый раз надо выбирать предмет который заканчивается как можно раньше
n=int(input())
a=list(map(int,input().split())) # Список A содержит в себе время начала i-того занятия
b=list(map(int,input().split())) # Список B содержит в себе время окончания i-того занятия

c = list(zip(a,b))
c.sort(key=lambda x: x[1]) # Сортировка по времени окончания занятии, это позволит нам выбирать занятия которые заканчиваются как можно раньше
n=k=0
for i,j in c: # итератор содержит 2 значения, i-начало и j-конец текущего занятия
    if i>=n: # Если начало занятия по времени позже чем конец предыдущего, то выполняется условие
        k+=1
        n=j # Присваиваем n конец текущего занятия, чтобы в дальнейшем проверять условие

print(k)