# У нас есть n прямоугольных пастбищ с координатами левого нижнего и правого верхнего угла (x1,y1), (x2,y2). Требуется найти минимально возможный (по длине) квадратный загон который покрывает m пастбищ(вся область пастбища находится внутри загона некоторой длины)
n,m = map(int, input().split())
a=[]
for i in range(n):
    x1,y1,x2,y2 = map(int,input().split())
    a.append(max(x2,y2)) # x1,y1 по условию больше или равен одному. Поэтому берем максимумальную длину из координат правого верхнего угла пастбища и сравниваем с длиной загона(квадрата) 

l=1; r=10**9 # Минимальная и максимальная длина загона
ans = r
while l<=r:
    mid = (l+r)//2 # Берем середину размера загона
    t=0 # Количество пастбищ которые помещаются в текущий размер загона
    for i in range(n):
        if a[i]<=mid: # Если длина i-того пастбища меньше чем mid(то есть помещается в загон размера mid) то увеличиваем t.
            t+=1
    if t>=m: # Если количество пастбищ которое поместилось в загон больше или равно необходимому, это значит что можно уменьшить загон
        ans=mid # Оставляем ans=mid если мы угадали с размером
        r=mid-1 # Уменьшаем верхнюю границу загона
    else:
        l=mid+1 # Если же количество пастбищ меньше необходимого то увеличиваем нижнюю границу до середины
print(ans)

    

