# Задачка о ступеньках. У нас есть лестница с N ступеньками, за раз можно перешагивать от 1 до K ступенек включительно. Найти количество способов подняться наверх лестницы
# Для решения надо понять что колво способов добраться до i-той ступеньки, это колво способов добраться до (i-1)+(i-2)+...+(i-k). 
n=int(input())
k=int(input())
a=[0]*(n+1)
a[0]=1 # Колво способов добраться до нулевой ступеньки это 1
for i in range(1,n+1):
    h=min(i,k) # 
    for j in range(1,h+1):
        a[i]+=a[i-j]
print(a[n])
 