# Алгоритм Беллмана-Форда позволяет найти кратчайшие пути от стартовой вершины до всех остальных вершин в взвешенном и ориентированном графе представленном в виде списка ребер за O(V*E), Space O(V)
# Особенность алгоритма в том, что он работает и с отрицательными ребрами и позволяет определить существуют ли отрицательные циклы которых можно достичь из стартовой вершины
# Отрицательный цикл это цикл сумма ребер которого дает число меньше нуля. То есть, каждый раз проходя по циклу можно получать значения все меньше и меньше 
# Идея алгоритма заключается в том, что мы релаксируем каждое ребро N-1 раз. Если после этого какое-либо ребро может быть релаксировано еще раз, значит в графе есть отрицательный цикл
def bellman_ford(start):
    n=len(edges)
    INF = 1007
    dist = [INF]*(n + 1)
    dist[start] = 0

    # Релаксируем каждое ребро. В лучшем случае временная сложность составит O(E), если после первой итерации все ребра будут окончательно релаксированы(граф обычная цепь с правильным порядком списка ребер)
    for i in range(n - 1): # Улучшаем кратчайшие пути n-1 раз(где n количество ребер), спустя столько итерации гарантированно получаем правильный массив с кратчайшим путем от стартовой точки до остальных(при отсутствии отрицательных циклов)
        improved = False
        for u, v, w in edges:
            if dist[u] != INF and dist[u] + w < dist[v]:
                dist[v] = dist[u] + w
                improved = True
        if not improved: # Если в кратчайшем пути не произошло изменении, то можно остановиться(дальнейшие итерации ничего не дадут)
            break

    for u, v, w in edges: # Проверка на отрицательный цикл(если основной цикл завершился через break, то необязательно делать проверку). Если спустя n-1 итерации в проверочном цикле мы сможем получить более короткую дистанцию значит отрицательный цикл есть.
        if dist[u] != INF and dist[u] + w < dist[v]:
            return None  # Вернули None если есть отрицательный цикл

    return dist

n=int(input("Количество ребер"))
edges=[]
for i in range(n):
    u,v,w=map(int,input("От _ до _ с весом _ ").split())
    edges.append((u,v,w))

k=int(input("Стартовая вершина: "))
print(bellman_ford(k))

# edges = [
#     (1, 2, 5),
#     (2, 3, 1)
# ]