# DFS(Depth-First-Search) - алгоритм обхода графа в глубину использующий рекурсию или стэк, который исследует путь граф пока не дойдет до конца, а затем возвращается назад и повторяет операцию для соседей. Работает за O(V+E) для списка смежности, за O(V^2) для матрицы смежности
# Применение DFS: топологическая сортировка, поиск циклов, поиск компонентов сильной связности(strongly connected components)
def dfs(v): # Функция вернет все посещенные вершины (через рекурсию)
    visited[v]=True # Посетили вершину
    print(v, end=" ")
    for i in a[v]: # Идем по соседям вершины, как только нашли не посещенную вершину спускаемся в нее и повторяем операцию
        if not visited[i]:
            dfs(i)

n=int(input())
a=dict() # Adjacency list это словарь ключ которого - номер вершины, а значение - список смежных с ключом вершин(с которыми связан ключ). Можно заменить словарь на список списков
for i in range(1,n+1):
    b=list(map(int,input().split()))
    a[i]=b

k=int(input()) # Вершина с которой начнем исследование графа
visited=[False]*(n+1)
dfs(k)

# graph = {
#     1: [2, 3],
#     2: [1, 4],
#     3: [1, 4],
#     4: [2, 3, 5],
#     5: [4]
# }


