# Сумма каких то чисел равна N, необходимо максимизировать произведение этих чисел
# Для этого надо разбить число N на сумму чисел 2 и 3. Так как, именно в таком случае произведение будет максимальной. Большая часть чисел должна быть 3
n=int(input())
if n==1:
    print(1)
elif n%3==2: # Если остаток от деления на 3 является 2, то нам остается лишь умножить наше число на 2
    print(3**(n//3)*(n%3)) # Если сумма равняется 3*(N//3)+2, то произведение будет 3**(N//3)*2
else:
    print(3**(n//3-n%3)*(4**(n%3)))
# Если остаток равняется 1, это означает что в произведении в конце будет 1, а это не максимизирует наше произведение. В этом случае надо убрать 3*1 и заменить на 2*2, то есть 4
# Если остаток равняется 0, это значит что 3**(N//3) и есть ответ.
