# Найти количество компонентов графе с помощью DFS. Компонент графа это максимальный подграф вершины в котором связаны друг с другом(между любой парой вершин существует путь)
def dfs(v): 
    visited[v]=True
    for i in a[v]:
        if not visited[i]:
            dfs(i)

n=int(input())
a=dict() # Adjacency list это словарь ключ которого - номер вершины, а значение - список смежных с ключом вершин(с которыми связан ключ). Можно заменить словарь на список списков
for i in range(1,n+1):
    b=list(map(int,input().split()))
    a[i]=b

t=0
visited=[False]*(n+1)
for i in range(1,n+1):
    if not visited[i]: # Если бы весь граф был связан, то на первой итерации мы бы посетили все вершины(соответственно количество компонентов 1 и это сам граф). Но если после первой итерации остаются не посещенные вершины, то увеличиваем количество компонентов
        dfs(i)
        t+=1
print(t)

# graph = {
#     1: [2, 3],
#     2: [1, 4],
#     3: [1, 4],
#     4: [2, 3, 5],
#     5: [4]
# }


