# Heap - структура данных на основе бинарного дерева (каждый корень имеет лишь два ребенка), в котором родитель всегда по значению меньше или равен детям
# Min.heap - родитель всегда по значению меньше или равен детям. А это значит что минимальным элементом в дереве будет корень.
# Min.heap  с выводом и удалением минимума

def insert(x):
    heap.append(x)
    i=len(heap)-1 

    while i>0: 
        parent = (i-1)//2 
        if heap[parent]>heap[i]:
            heap[parent],heap[i]=heap[i],heap[parent]
            i=parent 
        else:
            break 

def extract_min(): # Функция которая возвращает минимум и удаляет ее
    if not heap:
        return None
    if len(heap)==1:
        return heap.pop()
    a=heap[0] # Сохраняем первый элемент(минимум)
    heap[0]=heap.pop() # Меняем местами первый и последний элемент(при этом последний удаляется)
    i=0
    while True: # Heapify down просеивает элемент вниз на свое место (в данном случае элемент который стал головой дерева), тем самым восстанавливая порядок дерева heap. После завершения цикла корнем дерева(heap[0]) опять станет минимальный элемент, а каждый родитель снова будет меньше детей 
        smallest=i # Голова равна текущему индексу(считаем что она наименьшая), при первой итерации голова равна корню всего дерева
        left = 2*i+1 # Индекс левого ребенка
        right = 2*i+2 # Индекс правого ребенка

        if left<len(heap) and heap[left]<heap[smallest]: # Если левый меньше головы, то минимумом становится левый 
            smallest = left
        if right<len(heap) and heap[right]<heap[smallest]: # Если правый меньше головы(или левого), то минимум становится правый
            smallest=right
        if smallest==i: # Если же условия выше не выполнились, это значит что либо голова меньше родителей(значит все правильно) или что индексы left и right больше длины массива(значит детей текущей головы нет) и можно прервать цикл
            break
        heap[i],heap[smallest]=heap[smallest],heap[i] # Меняем местами голову и минимум
        i=smallest # Спускаемся к ребенку с которым поменяли значение головы. Так как текущий ребенок все еще может быть больше своих детей. 
    return a # Возвращаем минимум который был до удаления


heap=[]
a=list(map(int,input().split()))
for i in a:
    insert(i)
print(heap)
print(heap[0])
print(extract_min())
print(heap)
