# BFS(Breadth-First-Search) - алгоритм обхода графа в ширину использующий queue, который исследует граф на текущем уровне, а затем переходит на следующий. Работает за O(V+E) для списка смежности, и за O(V^2) для матрицы смежности
def bfs(v): # Функция вернет все посещенные вершины
    visited[v]=True
    queue=[v] # Очередь позволяет обходить весь текущий уровень, а затем переходить на следующий. При обходе текущего уровня не посещенные вершины добавляются в очередь  
    result=list()
    
    while queue: # Выполняется пока очередь не пустая(есть вершины которые надо посетить)
        node=queue.pop(0) # Текущая вершина равна первой вершине в очереди, удаляем вершину на которой мы находимся
        for i in a[node]: 
            if not visited[i]: # Если не посещали эту вершину, то добавялем ее в очередь и в массив хранящий посещенные вершины
                visited[i]=True
                queue.append(i)
        result.append(node) # Добавляем в массив с посещенными вершинами текущую вершину
    return result


n=int(input())
a=dict() # Adjacency list это словарь ключ которого - номер вершины, а значение - список смежных с ключом вершин(с которыми связан ключ). Можно заменить словарь на список списков
for i in range(1,n+1):
    b=list(map(int,input().split()))
    a[i]=b

visited=[False]*(n+1) # Массив хранящий посещенные вершины

k=int(input()) # Вершина с которой начнем исследование графа
print(bfs(k))

# graph = {
#     1: [2, 3],
#     2: [1, 4],
#     3: [1, 4],
#     4: [2, 3, 5],
#     5: [4]
# }


