# Любое натуральное число можно представить в виде суммы последовательных натуральных чисел. Требуется найти наибольшую такую последовательность.
# Для этого можно воспользоваться формулой S = n+(n+1)+(n+2)+...+(n+k-1) = k*n + k*(k-1)//2
# В этой формуле можно выразить n = (S-(k*(k-1)//2))//k. Здесь n должен быть натуральным и целым числом, а это значит что числитель должен делиться на k без остатка. K в свою очередь указывает на саму длинну последовательности
s=int(input())
for k in range(2,s):
    max_=0
    m=s-(k*(k-1))//2
    if m>0 and m%k==0:
        n=m//k # Выражение которые мы описывали выше
        if n>0:
            max_=k
            start=n
    if max_>0:
        b=[start+i for i in range(max_)] # Наш список далее будет меняться, если будет найдена более длинная последовательность
print(b)