# Путешествие. У нас есть m количество наборов входных данных. В каждом наборе четыре числа. n-колво километров которое нужно пройти, a-пройденное расстояние в первый, b-второй, c-третий дни. Далее в четвертый день проходится столько же сколько и в первый, в пятый столько же сколько и второй и так далее. На какой день будет пройдено n километров? 
m=int(input())
for i in range(m):
    n,a,b,c=map(int,input().split())
    start=1; end=n; ans=n # Минимально нужен один день(если в первый же день прошли n км), а максимально n дней(если каждый день проходить по 1 км).
    while start<=end:
        mid=(start+end)//2 # Проверим можно ли пройти расстояние за mid дней
        t=(mid//3)*(a+b+c) # Суммарное расстояние пройденное за mid дней(далее добавим остатки)
        if mid%3==1:
            t+=a
        if mid%3==2:
            t+=a+b
        if t>=n: # Если mid дней достаточно чтобы пройти расстояние уменьшаем правый край
            end=mid-1
            ans=mid
        else:
            start=mid+1 # иначе левый
    print(ans)
        
    

    



        



