# BFS(Breadth-First-Search) - алгоритм обхода графа в ширину использующий queue, который исследует граф на текущем уровне, а затем переходит на следующий.
def bfs(v,n): # Функция вернет все посещенные вершины
    visited=[False]*n # Массив хранящий посещенные вершины
    queue=[v] # Очередь позволяет обходить весь текущий уровень, а затем переходить на следующий. При обходе текущего уровня не посещенные вершины добавляются в очередь  
    visited[v]=True
    result=list()
    
    while queue: # Выполняется пока очередь не пустая(есть вершины которые надо посетить)
        node=queue.pop(0) # Текущая вершина равна первой вершине в очереди, удаляем вершину на которой мы находимся
        for i in range(n):
            if a[node][i] and (not visited[i]): # Если не посещали эту вершину и значение a[node][i]==1(то есть между этими вершинами есть ребро), то добавялем ее в очередь и в массив хранящий посещенные вершины
                visited[i]=True
                queue.append(i)
        result.append(node+1) # Добавляем в массив с посещенными вершинами текущую вершину
    return result


n=int(input())
a=[] # Adjacency matrix(матрицы смежности) - матрица размера n*n. (n-колво вершин в графе)
for i in range(n):
    b=list(map(int,input().split())) # a[i][j]=1 если между вершиной i и j есть ребро. То есть в i-той строке матрицы все столбцы j связанные с вершиной под номером i имеют значение 1.
    a.append(b)

k=int(input()) # Вершина с которой начнем исследование графа
print(bfs(k-1,n))

# graph = [
#     [0, 1, 0, 1],  # вершина 1 соединена с 2 и 4
#     [1, 0, 1, 0],  # вершина 2 соединена с 1 и 3
#     [0, 1, 0, 1],  # вершина 3 соединена с 2 и 4
#     [1, 0, 1, 0]   # вершина 4 соединена с 1 и 3
# ]
