# Есть n машинок, каждая из которой производит один товар за a[i] секунд. Нужно произвести m товаров за минимально возможное время учитывая что все машинки работают одновременно
n,m=map(int,input().split())
a=list(map(int,input().split()))
l=1; r=max(a)*m # Минимальное время 1(если бы у нас было >=m машинок каждая из которых производит товар за 1 секунду). Максимальное время это умножение максимального значения на m 
ans=r 
while l<=r:
    mid=(l+r)//2 # Выбираем среднее время
    t=0
    for i in a:
        t+=mid//i # Суммируем количество товаров которое можно производить за mid секунд
        if t>=m: # Если можно произвести больше необходимого, то можно сократить время
            ans=mid
            r=mid-1
            break
    else:
        l=mid+1 # Если нельзя, то увеличим время
print(ans)