# Topological sort с помощью DFS
# Topological sort работает только с ориентированными, не цикличными графами. Это линейная сортировка каждой пары вершин (u,v) где u идет раньше v(ориентированное ребро u->v). То есть это последовательность вершин в котором не нарушается порядок ориентированности. Может быть несколько различных сортировок для одного графа
def dfs(v): # Через рекурсию
    visited[v]=True # Посетили вершину
    for i in a[v]: # Идем по соседям вершины, как только нашли не посещенную вершину спускаемся в нее и повторяем операцию
        if not visited[i]:
            dfs(i)
    res.append(v) # Вершины добавляются с конца. То есть последняя посещенная вершина добавляется первой(поэтому в конце мы выведем в обратном порядке)

n=int(input())
a=dict() # Adjacency list это словарь ключ которого - номер вершины, а значение - список смежных с ключом вершин(с которыми связан ключ). Можно заменить словарь на список списков
for i in range(1,n+1):
    b=list(map(int,input().split()))
    a[i]=b

visited=[False]*(n+1)
res=[]*(n+1)
for i in range(1,n+1):
    if not visited[i]:
        dfs(i)

print(res[::-1])
# graph = {
#     1: [2, 3],
#     2: [1, 4],
#     3: [1, 4],
#     4: [2, 3, 5],
#     5: [4]
# }


