# Коровы и стойла. Даны n стойл с координатами a[i], нужно расставить k коров в стойла чтобы минимальное расстояние между коровами было как можно больше
n=int(input())
a=list(map(int,input().split()))
a.sort() # Сортируем массив
k=int(input())
start=1; end=a[-1]-a[0]; ans=1 # Минимальное расстояние это 1, максимальное это разница между крайними двумя коровами
while start<=end:
    mid=(start+end)//2 # Выбираем среднее расстояние
    m=1; t=a[0] # Уже стоит одна корова под индексом 0
    for i in range(1,n):
        if a[i]-t>=mid: # Если расстояние между предыдущей коровой больше выбранного значения, значит корову можно поставить(увеличиваем счетчик и меняем координату последней поставленной коровы)
            m+=1
            t=a[i]
    if m>=k: # Если расстояния mid хватает чтобы поставить k коров, то нужно увеличить расстояние
        ans=mid
        start=mid+1
    else:
        end=mid-1 # Если нет, то уменьшаем расстояние
print(ans)




    
