# У нас и противника есть по N солдат каждый из которых обозначается числом который показывает силу i-того солдата, если сила нашего солдата больше вражеского, то наш выживает, в противном случае умирает. Каждый солдат может сразиться лишь с одним вражеским. Требуется максимизировать число наших выживших солдат
def check(a,b,i,j):
    k=0 # Счетчик победивших солдат(наших)
    while i<len(a) and j<len(b):
        if a[i]>b[j]: # Если наш солдат побеждает вражеского, то сразу передвигаем оба индекса и увеличиваем k. Если же наш солдат проиграл то увеличиваем только индекс наших солдат пока не победит вражеского под старым индексом
            k+=1; j+=1
        i+=1
    return k
            

n=int(input())
a=list(map(int, input().split()))
b=list(map(int,input().split()))
a.sort()
b.sort()
print(check(a,b,0,0))