def rabin_karp(text, pattern):
    result=[]
    p=1
    n,m=len(text), len(pattern)
    
    h_patt=0 # Считаем хэш строки-паттерна по формуле: s[0]*p^0+s[1]*p^1+...+s[i]*p^i. То есть получается полином
    for i in range(m):
        h_patt+=ord(pattern[i])*p
        p*=29
    
    h=[0]*n # Создаем массив h для строки text. В этом массиве i-тый элемент хранит в себе хэш префикса строки text до i(префикс s[0...i])  
    h[0]=ord(text[0]) # Вычисляем i-тый хэш по формуле: h[i] = s[0]*p_pow[0] + s[1]*p_pow[1] + ... + s[i]*p_pow[i]
    p=29
    for i in range(1,n):
        h[i]=ord(text[i])*p + h[i-1]
        p*=29
    
    
    for i in range(n-m+1): # Считаем до n-m+1, так как на последней итерации i=n-m мы сравним хэш последних m символов(строки text) с хэшом паттерна
        cur_h=h[i+m-1] # cur_h хранит хэш m элементов строки text начиная с индекса i(s[i...i+m] то же самое что h[m-1+i]-h[i-1]). То есть cur_h хранит хэш подстроки(длины m) строки text(окно заканчивающееся на позиции i+m-1)
        if i:
            cur_h-=h[i-1] # С увеличением i передвигаем окно. Убрав h[i-1] мы тем самым оставляем хэш элементов s[i...i+m], то есть хэш подстроки соответствующий длине паттерна. Потому что h[i-1] хранит хэш элементов строки text(s[0...i])
        if cur_h==h_patt*(29**i):
            result.append(i) # Сравниваем хэши. Хэш паттерна умножаем на текущую степень p, чтобы степени в хэше паттерна и окна cur_h были одинаковы.
    
    return result



text = input()
pattern = input()
print(rabin_karp(text, pattern))