# Найти минимальную вместимость мешка с подарками чтобы можно было доставить подарки на n островов(в каждой остров нужно доставить a[i] подарков) делая не более m полетов. Каждый полет можно использовать не более чем на один остров
n,m = map(int,input().split())
a=list(map(int,input().split()))
l=1; r=max(a) # Минимальная вместимость мешка 1, а максимальная это наибольшее значение в массиве а(для случая когда можно сделать n полетов, и покрывать за каждый полет один остров целиком)
ans=r # ans можно убрать
while(l<=r):
    mid=(l+r)//2 # Берем вместимость как среднее между левым и правым краем
    t=0
    for i in range(n):
        t+=int(a[i]/mid-(1/mid)+1) # Делим количество подарков которые надо доставить на текущий остров на вместимость мешка и округляем вверх чтобы получить необходимое количество полетов на текущий остров. Суммируем количество перелетов для каждого острова. (Округляем вверх, так как если останется остаток то надо будет делать еще один полет в текущий остров) 
    if t<=m: # Если количество перелетов меньше или равно m, то можно уменьшить вместимость мешка
        ans=mid # Сохраняем mid если угадали с значением
        r=mid-1
    else:
        l=mid+1 # Если количество перелетов больше m, то надо увеличить вместимость мешка
print(ans)

