# Дается двумерный массив чисел, мы стоим на левом верхнем углу, финиш находится на правом нижнем углу. Надо добраться до финиша минимизируя суммы чисел которые будут встречаться по пути, при этом можно идти только вниз и вправо
n=int(input())
m=int(input())
a=[0]*n

for i in range(n):
    k=list(map(int,input().split())) # Заполняем наш первоначальный массив чисел
    a[i]=k

dp=[[0 for j in range(m)] for i in range(n)] # Заполняем массив dp нулями

dp[0][0]=a[0][0]
for i in range(1,n):
    dp[i][0]=dp[i-1][0]+a[i][0] # Первый столбец заполняем суммами левых ячеек, так как по крайней левой стороне можно пройти если идти только вниз

for i in range(1,m):
    dp[0][i]=dp[0][i-1]+a[0][i] # Первую строку заполняем суммами верхних ячеек, так как по крайней верхней стороне можно пройти если идти только вправо

for i in range(1,n):
    for j in range(1,m):
        dp[i][j]=min(dp[i-1][j], dp[i][j-1])+a[i][j] # Заполняем каждую ячейку пустого двумерного массива выбирая минимальный между левой и верхней ячейкой и суммируя с соответствующей ячейкой оригинального массива. Таким образом каждая ячейка будет содержать минимально возможное число состоящее из сумм предыдущих

print(dp[n-1][m-1]) # Ответом будет последняя ячейка массива которая содержит в себе минимально возможную сумму из всех ячеек оригинального массива */
    
