# Heap - структура данных на основе бинарного дерева (каждый корень имеет лишь два ребенка), в котором родитель всегда по значению меньше или равен детям. Такая структура данных называется binary heap
# Min.heap - родитель всегда по значению меньше или равен детям. А это значит что минимальным элементом в дереве будет корень.
# Max.heap - родитель всегда по значению больше или равен детям
# Если представить heap как бинарное дерево, то надо иметь ввиду что элементы сначала добавляются на текущий уровень слева направо, и только потом уровень переходит на следующий(спускается вниз). То есть пока не заполнится текущий уровень, нельзя переходить к следующему. Получается, все уровни кроме последнего(не всегда) будут заполнены. 
# Из этого следует что heap является полным бинарным деревом(complete binary tree). Минимальная высота такого дерева O(log n).
def insert(x): # Heapify up просеивает добавленный элемент вверх на свое место, восстанавливая порядок дерева(каждый родитель меньше детей)
    heap.append(x) # Добавляем элемент в конец массива
    i=len(heap)-1 # Индекс добавленного элемента

    while i>0: # Пока элемент не стал корнем. Корень имеет индекс 0. Если элемент становится 0, то он и так стал корнем
        parent = (i-1)//2 # Индекс родителя(на первой итерации индекс родителя добавленного элемента)
        if heap[parent]>heap[i]: # Если родитель больше ребенка, то меняем ребенка и родителя местами
            heap[parent],heap[i]=heap[i],heap[parent]
            i=parent # Меняем индекс на родителя(теперь уже ребенок предка). И опять сравниваем родителя с его родителем(то есть добавленный элемент x с новым родителем)
        else:
            break # Если же родитель меньше ребенка, то все правильно и можно прерывать цикл.



heap=[]
a=list(map(int,input().split()))
for i in a:
    insert(i)
print(heap)
print(heap[0])
