def rabin_karp(text, pattern):
    result=[]
    p=29
    n,m=len(text), len(pattern)
    k=max(n,m)
    p_pow=[1]*k # Массив p_pow имеет длину наибольшей строки и хранит p^i для каждого индекса i. p_pow[0]=1, так как p^0 это 1.
    for i in range(1,k):
        p_pow[i]=p_pow[i-1]*p
    
    h_patt=0 # Считаем хэш строки-паттерна по формуле: (s[0]-'a'+1)*p_pow[0]+(s[1]-'a'+1)*p_pow[1]+...+(s[i]-'a'+1)*p_pow[i]
    for i in range(m):
        h_patt+=(ord(pattern[i])-97+1)*p_pow[i]
    
    h=[0]*n # Создаем массив h для строки text. В этом массиве i-тый элемент хранит в себе хэш префикса строки text до i(префикс s[0...i])  
    h[0]=(ord(text[0])-97+1) # Вычисляем i-тый хэш по формуле: h[i] = (s[0]-'a'+1)*p_pow[0] + (s[1]-'a'+1)*p_pow[1] + ... + (s[i]-'a'+1)*p_pow[i]
    for i in range(1,n):
        h[i]=((ord(text[i])-97+1)*p_pow[i]) + h[i-1]
    
    
    for i in range(n-m+1): # Считаем до n-m+1, так как на последней итерации i=n-m мы сравним хэш последних m символов(строки text) с хэшом паттерна
        cur_h=h[m-1+i] # cur_h хранит хэш m элементов строки text начиная с индекса i(s[i...i+m] то же самое что h[m-1+i]-h[i-1]). То есть cur_h хранит хэш подстроки(длины m) строки text.
        if i:
            cur_h-=h[i-1] # С увеличением i передвигаем окно. Убрав h[i-1] мы тем самым оставляем хэш элементов s[i...i+m], то есть хэш подстроки соответствующий длине паттерна. Потому что h[i-1] хранит хэш элементов строки text(s[0...i])
        if cur_h==h_patt*p_pow[i]:
            result.append(i) # Сравниваем хэши. Хэш паттерна умножаем на текущую степень p, чтобы степени в хэше паттерна и окна cur_h были одинаковы.
    
    return result



text = input()
pattern = input()
print(rabin_karp(text, pattern))