# Topological sort с помощью DFS и проверкой цикла
def dfs(v): # Через рекурсию
    visited[v]=1 # 1 - вершина в рекурсии, 0 - не посетили вершину, 2 - закончили(можно добавлять в результат)
    for i in a[v]: # Идем по соседям вершины, как только нашли не посещенную вершину спускаемся в нее и повторяем операцию
        if visited[i]==0:
            dfs(i)
        elif visited[i]==1:
            exit()
    visited[v]=2
    res.append(v) # Вершины добавляются с конца. То есть последняя посещенная вершина добавляется первой(поэтому в конце мы выведем в обратном порядке)


n=int(input())
a=dict() # Adjacency list это словарь ключ которого - номер вершины, а значение - список смежных с ключом вершин(с которыми связан ключ). Можно заменить словарь на список списков
for i in range(1,n+1):
    b=list(map(int,input().split()))
    a[i]=b

visited=[0]*(n+1)
res=[]*(n+1)
for i in range(1,n+1):
    if visited[i]==0:
        dfs(i)

print(res[::-1])
# graph = {
#     1: [2, 3],
#     2: [1, 4],
#     3: [1, 4],
#     4: [2, 3, 5],
#     5: [4]
# }


