# Rabin-Karp - алгоритм для поиска определенных подстрок в строке, хэширующий символы для нахождения подстроки в строке за О(n+m).
# Идея в том чтобы сравнивать текущий хэш подстроки(префикса) строки text фиксированной длины m с хэшем паттерна(также длины m).
def rabin_karp(text, pattern):
    n, m = len(text), len(pattern)
    p = 26 # За основание системы счисления взяли 26(так как у нас всего 26 букв английского языка), чтобы было меньше коллизий
    mod = 10001 # За mod надо брать большое и простое число, чтобы остаток получался уникальный.
    result = []
    # power = pow(p, m - 1, mod)  # p^(m-1)%mod. Используется для удаления старого символа из хэша

    pattern_hash = 0
    for ch in pattern: # Находим хэш паттерна
        pattern_hash = (pattern_hash * p + ord(ch)) % mod # Хэш строки pattern можно посчитать как некоторое число в системе счисления с основанием p. Наглядное представление: (s[0]*p^(m-1)+s[1]*p(m-2)+...+s[m-1]) % mod

    current_hash = 0
    for i in range(m): # Находим хэш первой подстроки в тексте соответствующий длине паттерна(первое окно)
        current_hash = (current_hash * p + ord(text[i])) % mod # Делим на mod с остатком.

    for i in range(n - m + 1): # Считаем до n-m+1, так как на последней итерации i=n-m и мы сравним последние m символов с паттерном
        if current_hash == pattern_hash: # Если хэши одинаковые, то с высокой вероятностью и строки одинаковые
            if text[i:i+m] == pattern: # Наглядно проверяем на всякий случай
                result.append(i)  # Добавляем к массиву индекс в которой нашли совпадение

        # Каждый раз сдвигаем окно вправо
        if i < n - m: # Условие нужно чтобы понять, можем ли мы передвинуть окно. Если мы находимся на индексе n-m, значит нам осталось m символов(m-1 индексов) чтобы дойти на конец строки и уже нельзя передвинуть окно(так как выйдем за границы строки)
            current_hash = (current_hash - ord(text[i]) * ((p**(m-1))%mod)) * p + ord(text[i+m]) % mod # -ord(text[i])*power удаляет старый символ(самый первый) из хэша.
            current_hash = (current_hash + mod) % mod  # Защита от отрицательных чисел.

    return result


text = input()
pattern = input()
print(rabin_karp(text, pattern))
