# Бинарный поиск по ответу
# Есть два принтера, первый печатает 1 лист за x секунд, второй за y. Надо напечатать n листов за минимальное колво времени, при этом можно использовать оба принтера одновременно
a=list(map(int, input().split()))
n=a[0]; x=a[1]; y=a[2]
l=0 # Минимальное время
r=min(x,y)*n # Максимальное время, если бы мы использовали только один принтер которому нужно меньше времени чтобы напечатать n листов
while l<r:
    m=(l+r)//2 # Середина времени
    if m//x+m//y>=n: # m/x + m/y колво листов которые можно напечатать за m секунд используя оба принтера
        ans=m
        r=m-1 # Если m секунд хватает на то чтобы напечатать n листов, значит надо поменять максимальное время на m
    else:
        l=m+1 #  Если же m секунд не хватает, значит минимальное время будет m+1
print(ans)

