# Вычислить минимальное количество операции (вставка,замена или удаление) символа, для преобразования строки s в строку t
s=str(input())
t=str(input())
a=len(s)+1; b=len(t)+1
dp=[[0 for i in range(len(s)+1)] for j in range(len(t)+1)] # Создаем двумерный массив в котором i-тая строка является первыми i символами строки s, а j-тый столбец является первыми j символами строки t 
for i in range(1,a): # Заполняем первые i строк и первые j столбцов, числами i и j соответственно, на случай если один из строк окажется пустым 
    dp[i][0]=i
for i in range(1,b):
    dp[0][i]=b

for i in range(1,a):
    for j in range(1,b):
        if s[i-1]==t[j-1]: # Если символы строк совпадают, то можно ничего не менять и взять dp для предыдущего символа каждой строки */
            dp[i][j]=dp[i-1][j-1]
        else:
            dp[i][j]=min(min(dp[i-1][j],dp[i][j-1])+1,dp[i-1][j-1]+1) # Если символы строк не совпадают, то надо выбрать минимальный между удалением dp[i-1][j](выбираем dp предыдущей символа строки s, и того же символа строки t), вставкой dp[i][j-1](остаемся на том же символе строки s) , и заменой dp[i-1[j-1](берем за основу dp для предыдущих символов обеих строк), и прибавить к каждому +1 так как мы совершаем одну операцию
print(dp[a-1][b-1]) # Последняя строка и последний столбец и будет ответом