# Хэш-таблица - структура данных которая хранит пары ключ-значение с помощью которой можно совершать поиск и удаление по ключу в среднем за О(1)
size=101 # Размер хэш-таблицы. Желательно должен быть простым числом в 1.5-2 раза больше количества элементов которые мы добавим.
# Если размер хэш-таблицы больше количества элементов которые будут добавлены, то индекс всегда уникальный. Если же нет, то индексы могут повторяться, но при большом размере таблицы будут равномерно распределены(в ячейках будет примерно одинаковое количество пар)

# Коллизия - два разных ключа равны одинаковому индексу после хэширования(hash(a)%size), то есть два разных ключа попадают в одну ячейку

# Функция проходит по ячейке index хэш-таблицы. В случае коллизии новый ключ вставляется в ближайшую свободную. Линейное зондирование (linear probing)
# Ниже функция связанная с методом Separate chaining(метод цепочек). В этом методе каждая ячейка хэш-таблицы это массив пар ключ-значение. Мы проходимся по ячейке хэш-таблицы и в случае коллизии пара ключ-значение добавляется в конец массива
def put(key,value,index): # Добавить в индекс таблицы(в i-тый список большого списка) новую пару ключ-значение(или поменять если уже такая пара существует) 
    for i, (k,v) in enumerate(h_table[index]): # Функция enumerate возвращает пару (текущий индекс, элемент), в нашем случае (текущий индекс, (ключ, значение)). Нужно чтобы поменять i-тую пару на новую в ячейке. 
        if k==key:
            h_table[index][i]=(key,value) # Если ключ(пары которую хотим добавить) уже есть в таблице, то мы меняем существуюущую пару на новую.
            break
    else: # Если же не было коллизии или когда не нашли одинаковый ключ в ячейке, cрабатывает блок else.
        h_table[index].append((key,value)) # Добавляем в ячейку пару (ключ,значение).
    

def get(key, index):
    for k,v in h_table[index]: # Проходимся по ячейке хэш-таблицы.
        if k==key:
            print(v)
            break
    else:
        print("No elements with this key")

def remove(key, index):
    for i, (k,v) in enumerate(h_table[index]):
        if k==key:
            del h_table[index][i]




n=int(input("The number of elements: "))
h_table = [[] for _ in range(size)] # Создание пустой хэш-таблицы. Это список хранящий size списков. А каждый внутренний список хранит в себе элементы в виде пар (ключ, значение) 
for i in range(n):
    a,m=input("Key and value to put: ").split()
    put(a,m,hash(a)%size) # Хэш-функция hash(a) принимает обьект(строка,число и т.д) и возвращает его хэш-код(целое число). Используется для получения большого и уникального числа, которое при делении на размер хэш-таблицы (с остатком) даст уникальный индекс(почти всегда).

m=int(input("The number of values to remove: "))
for i in range(m):
    a=input("The key to remove: ")
    remove(a,hash(a)%size) # Одинаковые элементы дают одинаковый хэш. Поэтому можно получать доступ к одному и тому же хэшу через один ключ.

m=int(input("The number of values to get: "))
for i in range(m):
    a=input("The key: ")
    print("The value:", end=" ")
    get(a,hash(a)%size)

