# Дается ориентированный граф(возможно цикличный), можно ли удалить одно ребро так, чтобы после ее удаления граф остался ацикличным
def topo_sort(n,m):
    indeg1=indeg[:] # Создаем копию массива с indegree
    if m!=-1 and indeg1[m]!=0: 
        indeg1[m]-=1 # Уменьшаем indegree вершины которую хотим проверить(как будто удалили одно ребро ведущее к ней), после этого вершина потенциально может стать источником

    q = [] 
    for i in range(1,n+1):
        if indeg1[i] == 0: # Ищем источник
            q.append(i)
    
    k=0
    while q:
        node = q.pop(0)
        k+=1 # Считаем количество вершин которые мы посетили

        for i in a[node]:
            indeg1[i]-=1
            if indeg1[i]==0:
                q.append(i)

    return k==n # Если это количество совпало с размером списка смежности, то топологическая сортировка затронула все вершины, а значит циклов нет. 


n=int(input())
indeg=[0]*(n+1)
a=dict()
for i in range(1,n+1):
    b=list(map(int,input().split()))
    for j in b:
        indeg[j]+=1 # Считаем indegree каждой вершины
    a[i]=b

if topo_sort(n,-1): # Если граф уже ацикличный(топологическая сортировка проходит без удаления ребра), то выводим YES 
    print("YES")
    exit()

for i in range(1,n+1):
    if indeg[i]==0: # Ищем вершины которые не являются источниками сами по себе(пропускаем источники)
        continue
    if topo_sort(n,i):
        print("YES")
        exit()

print("NO")