# Алгоритм Дейкстры для взвешенного графа позволяет найти кратчайшие расстояния от одной вершины до всех остальных за O(V^2+E)
# Алгоритм Дейкстры на каждом шаге выбирает вершину с наименьшей дистанцией и релаксирует все ребра соседних вершин благодаря приоритетной очереди
# Все ребра графа должны быть неотрицательны так как алгоритм предполагает что посещенный путь окончательно минимальный 
def insert(x):
    heap.append(x)
    i=len(heap)-1 

    while i>0: 
        parent = (i-1)//2 
        if heap[parent][0]>heap[i][0]:
            heap[parent],heap[i]=heap[i],heap[parent]
            i=parent 
        else:
            break

def extract_min(): # Функция которая возвращает минимум и удаляет ее
    if not heap:
        return None
    if len(heap)==1:
        return heap.pop()
    a=heap[0] # Сохраняем первый элемент(минимум)
    heap[0]=heap.pop() # Меняем местами первый и последний элемент(при этом последний удаляется)
    i=0
    while True: # Heapify down
        smallest=i # Голова равна текущему индексу(считаем что она наименьшая)
        left = 2*i+1 # Индекс левого ребенка
        right = 2*i+2 # Индекс правого ребенка

        if left<len(heap) and heap[left][0]<heap[smallest][0]: # Если левый меньше головы, то минимумом становится левый 
            smallest = left
        if right<len(heap) and heap[right][0]<heap[smallest][0]: # Если правый меньше головы(или левого), то минимум становится правый
            smallest=right
        if smallest==i: # Если же условия выше не выполнились, это значит что либо голова меньше родителей(значит все правильно) или что индексы left и right больше длины массива(значит детей текущей головы нет) и можно прервать цикл
            break
        heap[i],heap[smallest]=heap[smallest],heap[i] # Меняем местами голову и минимум
        i=smallest # Спускаемся к ребенку с которым поменяли значение головы. Так как текущий ребенок все еще может быть больше своих детей. 
    return a # Возвращаем минимум который был до удаления

n=int(input("Количество вершин: "))
a=dict() # Adjacency list который хранит не только вершины но и вес ребра с соответствующей вершиной в виде пары (вершина, вес ребра) 
for i in range(1,n+1):
    b=list(map(int,input(f"Вершины соседние с вершиной {i}: ").split()))
    c=list(map(int,input(f"Соответствующие веса вершин соседних с {i}: ").split()))
    a[i]=list(zip(b,c))

for i,j in a.items():
    print(f"{i}: {j}")

visited=[False]*(n+1)
heap=[] # Heap хранит пары (distance, u), то есть расстояние до текущей вершины
dist=[1001]*(n+1)
u=int(input("Стартовая вершина: "))
dist[u]=0
insert((0, u))  # Добавляем пару (расстояние, стартовая вершина) в heap.

while heap:
    d,u=extract_min() # Приоритетная очередь позволяет находить вершину с минимальным расстоянием (distance, u)
    if visited[u]:
        continue
    visited[u]=True
    for (v,w) in a[u]: # Проходимся по соседям найденной вершины
        if dist[u]+w<dist[v]: # Операция релаксирования. Если новая дистанция(вес ребра) от текущей вершины до соседней меньше старой дистанции, то
            dist[v]=dist[u]+w # Меняем дистанцию на новую
            insert((dist[v],v)) # Добавляем в приоритетную очередь расстояние и соответствующую вершину
print(dist[1:])
