# Минимальна возможная длина подмассива сумма элементов которой не меньше k. 
n,m = map(int,input().split())
a=list(map(int,input().split()))
b=[0]*(n+1)
for i in range(1,n+1): # Создаем массив префикса суммы начиная с 1, так как элемент под индексом 0 нам понадобится
    b[i]=b[i-1]+a[i-1]

l=1; r=n; ans=-1 # Минимальная длина 1(если один элемент в массиве уже >=k), а максимальная n(если сумма >=k только при суммировании всех элементов массива)
while l<=r:
    mid=(l+r)//2 # Выбираем среднюю длину подмассива между краями
    for i in range(mid,n+1): # Начинаем от длины mid
        cur=b[i]-b[i-mid] # Устанавливаем диапазон текущего mid используя свойство префикса суммы(b[r]-b[l-1] равно сумме [l,r]). Расстояние между b[i] и b[i-mid] всегда равна mid. То есть потенциальной длине подходящего подмассива
        if cur>=m: # Если длины mid подмассива достаточно чтобы ее сумма была >=m то можно сократить длину
            ans=mid # Сохраняем значение mid на случай если мы угадали
            r=mid-1
            break
    else:
        l=mid+1 # Если длины оказалось недостаточно, то нужно увеличить длину подмассива
    
print(ans)



