# DFS(Depth-First-Search) - алгоритм обхода графа в глубину использующий рекурсию или стэк, который исследует путь граф пока не дойдет до конца, а затем возвращается назад и повторяет операцию для соседей.
def dfs(v): # Функция вернет все посещенные вершины(через стэк)
    stack=[v] # Благодаря стэку последняя добавленная вершина исследуется первой, таким образом исследование идет по глубине. В самом начале стэка распологаются соседи первых вершин, они исследуются последними
    result=[]
    while stack:
        node = stack.pop()
        if not visited[node]:
            result.append(node)
            visited[node]=True

            for i in reversed(a[node]):
                if not visited[i]:
                    stack.append(i)
    return result


n=int(input())
a=dict() # Adjacency list это словарь ключ которого - номер вершины, а значение - список смежных с ключом вершин(с которыми связан ключ). Можно заменить словарь на список списков
for i in range(1,n+1):
    b=list(map(int,input().split()))
    a[i]=b

k=int(input()) # Вершина с которой начнем исследование графа
visited=[False]*(n+1)
print(dfs(k))

# graph = {
#     1: [2, 3],
#     2: [1, 4],
#     3: [1, 4],
#     4: [2, 3, 5],
#     5: [4]
# }


