# Минимизация максимальной суммы k подотрезков. Разбить массив на k подотрезков так, чтобы максимальная сумма этих отрезков была минимальной(k неизвестно)
def can_split(a, k, max_sum): # Можно ли поделить массив на k подотрезков не превышающих текущий mid
    count = 1  # начинаем с 1 подотрезка
    current_sum = 0
    
    for i in a:
        if current_sum + i > max_sum: # Если в отрезке сумма элементов превышает mid
            count += 1 # Начинаем новый подотрезок
            current_sum = i # Обновляем сумму на текущий элемент который входит в новый подотрезок
            if count > k:  # Слишком много подотрезков
                return False
        else:
            current_sum += i # Добавляем внутрь подотрезка элемент
    return True # Означает что можно спокойно поделить массив на k подотрезков не превышающих текущий max_sum(mid)


def split_array(a, k):
    left=max(a) # Миниммум если бы мы делили на n-1 отрезков. В каждом отрезке по одному элементу, соответственно ответом будет максимальный элемент
    right=sum(a) # Максимум если бы мы делили на 1 отрезок(то есть весь массив является этим отрезком)
    result = right
    
    while left <= right:
        mid = (left + right) // 2 # Берем середину между минимальным и максимальным 
        if can_split(a, k, mid):
            result = mid # Сохраняем result=mid на всякий случай(если mid и есть ответ). Окончательным ответом является mid, то есть максимальная сумма
            right = mid - 1 # Выполняется если все элементы были успешно разбиты на k или меньше подотрезков сумма которых не превышает mid. Это означает что mid скорее всего слишком большой. В этом случае можно сократить правый край до mid-1
        else:
            left = mid + 1  # Выполняется если количество подотрезков, сумма которых не превышает mid, превышает k. Значит mid слишком маленький и надо увеличить левый край
    return result


n=list(map(int, input().split()))
a=list(map(int, input().split()))
k=n[1]

print(split_array(a, k))