# Алгоритм Флойда-Уаршалла позволяет находить кратчайшие расстояния между всеми парами вершин в направленном(или ненаправленном) взвешенном графе(даже при отрицательных ребрах, но не при отрицательных циклах) представленного в виде матрицы смежности за O(V^3) (память O(V^2))
# Кратчайшее расстояние между двумя вершинами u и v, определяется как путь от u до v сумма ребер которых минимальна 
INF=10001
def floyd_warshall(): # Ищем кратчайшие пути пробуя проходить через вершину k.
    for k in range(n):
        for i in range(n):
            for j in range(n):
                if b[i][k]+b[k][j]<b[i][j]: # Если от i до j можно достичь начиная с i, пройдя через k и заканчивая вершиной j(при этом этот путь стоит меньше чем напрямую i->j, или прямой пути не сущесвует, то есть равна INF)
                    b[i][j]=b[i][k]+b[k][j] # То меняем ячейку на новую, заменяя суммой новой пути


n=int(input())
a=[[INF for j in range(n)] for i in range(n)] # Создаем граф где пока что путей между вершинами не существует(равна INF) 

# for i in range(n):
#     m=int(input(f"Колво вершин соседних с {i+1}: "))
#     for j in range(m):
#         v,w=map(int,input(f"Вершина и вес соседней с {i+1}: ").split())
#         a[i][v-1]=w
#     a[i][i]=0

for i in range(n):
    b=list(map(int,input(f"Вершины соседние с {i+1}: ").split()))
    c=list(map(int,input(f"Веса соответствующих вершин: ").split()))
    t=0
    a[i][i]=0 # Путь от вершины на саму себя обязательно должна быть 0
    for j in b:
        a[i][j-1]=c[t] # Добавляем стоимость пути от i-той вершины до соседних с ней
        t+=1

for i in a:
    print(i)

print()

b=[i[:] for i in a] # Массив b будет хранить кратчайшие пути для каждой пары вершин(b[i][j] кратчайший путь от вершины i до j)
floyd_warshall()

for i in b:
    print(i)
    





# INF = 1007

# def floyd_warshall(graph):
#     # копируем граф, чтобы не портить оригинал
#     n = len(graph)
#     dist = [row[:] for row in graph]

#     for k in range(n):
#         for i in range(n):
#             for j in range(n):
#                 if dist[i][k] + dist[k][j] < dist[i][j]:
#                     dist[i][j] = dist[i][k] + dist[k][j]

#     return dist


# # Пример графа из 4 вершин
# # 0 означает 0-ю вершину, 1 — первую, и т.д.
# # Матрица смежности:
# # INF означает, что ребра нет
# graph = [
#     [0,   5,   INF, 10],
#     [INF, 0,   3,   INF],
#     [INF, INF, 0,   1],
#     [INF, INF, INF, 0]
# ]

# dist = floyd_warshall(graph)

# for row in dist:
#     print(row)


