# Остовное дерево(spanning tree) связного, неоринтированного и взвешенного(ребра имеют вес) графа это подграф который содержит все вершины, имеет n-1 ребер и не содержит циклов. Добавление ребра в MST создает цикл.
# Минимальное остовное дерево имеет минимальную сумму веса ребер
# Алгоритм Прима позволяет найти минимальное остовное дерево путем добавления минимального ребра(на каждом шаге) которое ведет в непосещенную вершину. Минимальное ребро определяется с помощью приоритетной очереди которое всегда выводит текущее минимальное ребро и удаляет ее из кучи. Алгоритм работает за O(E*log(V))
def insert(x):
    heap.append(x)
    i=len(heap)-1 

    while i>0: 
        parent = (i-1)//2 
        if heap[parent][0]>heap[i][0]:
            heap[parent],heap[i]=heap[i],heap[parent]
            i=parent 
        else:
            break

def extract_min(): # Функция которая возвращает минимум и удаляет ее
    if not heap:
        return None
    if len(heap)==1:
        return heap.pop()
    a=heap[0] # Сохраняем первый элемент(минимум)
    heap[0]=heap.pop() # Меняем местами первый и последний элемент(при этом последний удаляется)
    i=0
    while True: # Heapify down
        smallest=i # Голова равна текущему индексу(считаем что она наименьшая)
        left = 2*i+1 # Индекс левого ребенка
        right = 2*i+2 # Индекс правого ребенка

        if left<len(heap) and heap[left][0]<heap[smallest][0]: # Если левый меньше головы, то минимумом становится левый 
            smallest = left
        if right<len(heap) and heap[right][0]<heap[smallest][0]: # Если правый меньше головы(или левого), то минимум становится правый
            smallest=right
        if smallest==i: # Если же условия выше не выполнились, это значит что либо голова меньше родителей(значит все правильно) или что индексы left и right больше длины массива(значит детей текущей головы нет) и можно прервать цикл
            break
        heap[i],heap[smallest]=heap[smallest],heap[i] # Меняем местами голову и минимум
        i=smallest # Спускаемся к ребенку с которым поменяли значение головы. Так как текущий ребенок все еще может быть больше своих детей. 
    return a # Возвращаем минимум который был до удаления



n=int(input())
a=dict() # Adjacency matrix который хранит не только вершины но и вес ребра с соответствующей вершиной в виде пары (вершина, вес ребра) 
for i in range(1,n+1):
    b=list(map(int,input(f"Вершины соседние с вершиной {i}: ").split()))
    c=list(map(int,input(f"Соответствующие веса вершин соседних с {i}: ").split()))
    a[i]=list(zip(b,c))

for i,j in a.items():
    print(f"{i}: {j}")

visited=[False]*(n+1)
visited[1]=True
heap=[]
edges=cost=0 # edges - считает колво ребер(которое не должно превысить n-1), cost считает сумму пути
for (i,j) in a[1]: # Начинаем с вершины 1(можно начать с любой вершины) и добавляем пару j,i(i-вершина, j-вес ребра из этой вершины) в heap, именно в таком порядке чтобы распределение в heap происходило по весу ребра
    insert((j,i))

print(1, end=" ")
while heap and edges<n-1:
    w,v=extract_min() # Приоритетная очередь позволяет находить минимальный вес ребра исходящего из текущей вершины(w-вес)
    if visited[v]:
        continue
    print(v, end=" ")
    visited[v]=True
    cost+=w
    edges+=1
    for (i,j) in a[v]:
        if not visited[i]:
            insert((j,i))
print()
print(cost)
